# Напишіть скрипт, який обчислює площу прямокутника a*b, 
# площу трикутника 0.5*h*a, площу кола pi*r**2 і цей 
# скрипт використати в іншому модулі, в якому ми запитуємо 
# користувача площу якої фігури він хоче обчислити. 

# (для виконання завдання необхідно імпортувати  модуль 
# math, а з нього функцію pow() та значення змінної пі, 
# модуль1, який містить три функції для знаходження площ, 
# модуль2, в якому імпортований модуль1 і виконується 
# основна логіка програми).

pi = 3.14
from math import pow

def square_of_rectangle(a, b):
    return a*b

def square_of_triangle(h, a):
    return 0.5*h*a

def square_of_circle(pi, r):
    return pi*(pow(r, 2))
